{
    "@context": "dtmi:dtdl:context;2",
    "@type": "Interface",
    "@id": "dtmi:cim:ACLineSegment;16",
    "displayName": "ACLineSegment",
    "description": "A wire or combination of wires, with consistent electrical characteristics, building a single electrical system, used to carry alternating current between points in the power system.\nFor symmetrical, transposed 3ph lines, it is sufficient to use  attributes of the line segment, which describe impedances and admittances for the entire length of the segment.  Additionally impedances can be computed by using length and associated per length impedances.\nThe BaseVoltage at the two ends of ACLineSegments in a Li",
    "extends": [
        "dtmi:cim:Conductor;16"
    ],
    "contents": [
        {
            "name": "b0ch",
            "displayName": "ACLineSegment.b0ch",
            "description": "Zero sequence shunt (charging) susceptance, uniformly distributed, of the entire line section.",
            "@type": "Property",
            "schema": "float"
        },
        {
            "name": "bch",
            "displayName": "ACLineSegment.bch",
            "description": "Positive sequence shunt (charging) susceptance, uniformly distributed, of the entire line section.  This value represents the full charging over the full length of the line.",
            "@type": "Property",
            "schema": "float"
        },
        {
            "name": "g0ch",
            "displayName": "ACLineSegment.g0ch",
            "description": "Zero sequence shunt (charging) conductance, uniformly distributed, of the entire line section.",
            "@type": "Property",
            "schema": "float"
        },
        {
            "name": "gch",
            "displayName": "ACLineSegment.gch",
            "description": "Positive sequence shunt (charging) conductance, uniformly distributed, of the entire line section.",
            "@type": "Property",
            "schema": "float"
        },
        {
            "name": "r",
            "displayName": "ACLineSegment.r",
            "description": "Positive sequence series resistance of the entire line section.",
            "@type": "Property",
            "schema": "float"
        },
        {
            "name": "r0",
            "displayName": "ACLineSegment.r0",
            "description": "Zero sequence series resistance of the entire line section.",
            "@type": "Property",
            "schema": "float"
        },
        {
            "name": "shortCircuitEndTemperature",
            "displayName": "ACLineSegment.shortCircuitEndTemperature",
            "description": "Maximum permitted temperature at the end of SC for the calculation of minimum short-circuit currents. Used for short circuit data exchange according to IEC 60909",
            "@type": "Property",
            "schema": "float"
        },
        {
            "name": "x",
            "displayName": "ACLineSegment.x",
            "description": "Positive sequence series reactance of the entire line section.",
            "@type": "Property",
            "schema": "float"
        },
        {
            "name": "x0",
            "displayName": "ACLineSegment.x0",
            "description": "Zero sequence series reactance of the entire line section.",
            "@type": "Property",
            "schema": "float"
        }
    ]
}