{
    "@context": "dtmi:dtdl:context;2",
    "@type": "Interface",
    "@id": "dtmi:cim:CoordinateSystem;16",
    "displayName": "CoordinateSystem",
    "description": "Coordinate reference system.",
    "contents": [
        {
            "name": "CoordinateSystem_crsUrn",
            "displayName": "CoordinateSystem.crsUrn",
            "description": "A Uniform Resource Name (URN) for the coordinate reference system (crs) used to define 'Location.PositionPoints'.\nAn example would be the European Petroleum Survey Group (EPSG) code for a coordinate reference system, defined in URN under the Open Geospatial Consortium (OGC) namespace as: urn:ogc:def:uom:EPSG::XXXX, where XXXX is an EPSG code (a full list of codes can be found at the EPSG Registry web site http://www.epsg-registry.org/). To define the coordinate system as being WGS84 (latitude, longitude) u",
            "@type": "Property",
            "schema": "string"
        },
        {
            "name": "IdentifiedObject_description",
            "displayName": "IdentifiedObject.description",
            "description": "The description is a free human readable text describing or naming the object. It may be non unique and may not correlate to a naming hierarchy.",
            "@type": "Property",
            "schema": "string"
        },
        {
            "name": "IdentifiedObject_mRID",
            "displayName": "IdentifiedObject.mRID",
            "description": "Master resource identifier issued by a model authority. The mRID is globally unique within an exchange context. Global uniqueness is easily achieved by using a UUID,  as specified in RFC 4122, for the mRID.  The use of UUID is strongly recommended.\nFor CIMXML data files in RDF syntax conforming to IEC 61970-552 Edition 1, the mRID is mapped to rdf:ID or rdf:about attributes that identify CIM object elements.",
            "@type": "Property",
            "schema": "string"
        },
        {
            "name": "IdentifiedObject_name",
            "displayName": "IdentifiedObject.name",
            "description": "The name is any free human readable and possibly non unique text naming the object.",
            "@type": "Property",
            "schema": "string"
        },
        {
            "name": "IdentifiedObject_energyIdentCodeEic",
            "displayName": "IdentifiedObject.energyIdentCodeEic",
            "description": "The attribute is used for an exchange of the EIC code (Energy identification Code). The length of the string is 16 characters as defined by the EIC code.\nReferences: \n",
            "@type": "Property",
            "schema": "string"
        },
        {
            "name": "IdentifiedObject_shortName",
            "displayName": "IdentifiedObject.shortName",
            "description": "The attribute is used for an exchange of a human readable short name with length of the string 12 characters maximum.",
            "@type": "Property",
            "schema": "string"
        }
    ]
}