{
    "@context": "dtmi:dtdl:context;2",
    "@type": "Interface",
    "@id": "dtmi:cim:TextDiagramObject;16",
    "displayName": "TextDiagramObject",
    "description": "A diagram object for placing free-text or text derived from an associated domain object.",
    "contents": [
        {
            "name": "Diagram",
            "displayName": "DiagramObject.Diagram",
            "description": "A diagram object is part of a diagram.",
            "@type": "Relationship",
            "target": "dtmi:cim:Diagram;16"
        },
        {
            "name": "DiagramObjectStyle",
            "displayName": "DiagramObject.DiagramObjectStyle",
            "description": "A diagram object has a style associated that provides a reference for the style used in the originating system.",
            "@type": "Relationship",
            "target": "dtmi:cim:DiagramObjectStyle;16"
        },
        {
            "name": "IdentifiedObject",
            "displayName": "DiagramObject.IdentifiedObject",
            "description": "The diagram objects that are associated with the domain object.",
            "@type": "Relationship",
            "target": "dtmi:cim:IdentifiedObject;16"
        },
        {
            "name": "drawingOrder",
            "displayName": "DiagramObject.drawingOrder",
            "description": "The drawing order of this element. The higher the number, the later the element is drawn in sequence. This is used to ensure that elements that overlap are rendered in the correct order.",
            "@type": "Property",
            "schema": "integer"
        },
        {
            "name": "isPolygon",
            "displayName": "DiagramObject.isPolygon",
            "description": "Defines whether or not the diagram objects points define the boundaries of a polygon or the routing of a polyline. If this value is true then a receiving application should consider the first and last points to be connected.",
            "@type": "Property",
            "schema": "boolean"
        },
        {
            "name": "offsetX",
            "displayName": "DiagramObject.offsetX",
            "description": "The offset in the X direction. This is used for defining the offset from centre for rendering an icon (the default is that a single point specifies the centre of the icon).\n\nThe offset is in per-unit with 0 indicating there is no offset from the horizontal centre of the icon.  -0.5 indicates it is offset by 50% to the left and 0.5 indicates an offset of 50% to the right.",
            "@type": "Property",
            "schema": "float"
        },
        {
            "name": "offsetY",
            "displayName": "DiagramObject.offsetY",
            "description": "The offset in the Y direction. This is used for defining the offset from centre for rendering an icon (the default is that a single point specifies the centre of the icon).\n\nThe offset is in per-unit with 0 indicating there is no offset from the vertical centre of the icon.  The offset direction is dependent on the orientation of the diagram, with -0.5 and 0.5 indicating an offset of +/- 50% on the vertical axis.",
            "@type": "Property",
            "schema": "float"
        },
        {
            "name": "rotation",
            "displayName": "DiagramObject.rotation",
            "description": "Sets the angle of rotation of the diagram object.  Zero degrees is pointing to the top of the diagram.  Rotation is clockwise.",
            "@type": "Property",
            "schema": "float"
        },
        {
            "name": "description",
            "displayName": "IdentifiedObject.description",
            "description": "The description is a free human readable text describing or naming the object. It may be non unique and may not correlate to a naming hierarchy.",
            "@type": "Property",
            "schema": "string"
        },
        {
            "name": "mRID",
            "displayName": "IdentifiedObject.mRID",
            "description": "Master resource identifier issued by a model authority. The mRID is globally unique within an exchange context. Global uniqueness is easily achieved by using a UUID,  as specified in RFC 4122, for the mRID.  The use of UUID is strongly recommended.\nFor CIMXML data files in RDF syntax conforming to IEC 61970-552 Edition 1, the mRID is mapped to rdf:ID or rdf:about attributes that identify CIM object elements.",
            "@type": "Property",
            "schema": "string"
        },
        {
            "name": "name",
            "displayName": "IdentifiedObject.name",
            "description": "The name is any free human readable and possibly non unique text naming the object.",
            "@type": "Property",
            "schema": "string"
        },
        {
            "name": "text",
            "displayName": "TextDiagramObject.text",
            "description": "The text that is displayed by this text diagram object.",
            "@type": "Property",
            "schema": "string"
        },
        {
            "name": "energyIdentCodeEic",
            "displayName": "IdentifiedObject.energyIdentCodeEic",
            "description": "The attribute is used for an exchange of the EIC code (Energy identification Code). The length of the string is 16 characters as defined by the EIC code.\nReferences: \n",
            "@type": "Property",
            "schema": "string"
        },
        {
            "name": "shortName",
            "displayName": "IdentifiedObject.shortName",
            "description": "The attribute is used for an exchange of a human readable short name with length of the string 12 characters maximum.",
            "@type": "Property",
            "schema": "string"
        }
    ]
}